---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarShapeArcReferenceType
source: html/0552910e-83f5-70bb-4b87-14ce00d10bdb.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeArcReferenceType

A Rebar Shape Definition constraint that is
 measured to a bend must take the bar diameter into
 account by specifying whether it measures to
 the exterior, centerline, or interior of the bend.

## Syntax (C#)
```csharp
public enum RebarShapeArcReferenceType
```